jQuery(document).ready(function($) {

  let suggestions;
  let officesJsonUrl =
    'https://raw.githubusercontent.com/t-mazgalov/wordpress-econt-offices-plugin/master/data/offices.json';
  $.getJSON(officesJsonUrl, function(data) { suggestions = data; })
  .fail(function() {
    suggestions = [
       {
          "value":"7538 с.Айдемир",
          "data":[
             "7538 Айдемир"
          ]
       },
       {
          "value":"8500 гр.Айтос",
          "data":[
             "8501 Айтос Автогара",
             "8503 Айтос Орела"
          ]
       },
       {
          "value":"9154 гр.Аксаково",
          "data":[
             "9040 Аксаково"
          ]
       },
       {
          "value":"6750 гр.Ардино",
          "data":[
             "6750 Ардино"
          ]
       },
       {
          "value":"4230 гр.Асеновград",
          "data":[
             "4234 Асеновград",
             "4231 Асеновград АБВ",
             "4236 Асеновград Долни Воден",
             "4232 Асеновград Запад",
             "4235 Асеновград ул. Капитан Райчо 9",
             "4233 Асеновград Христо Ботев"
          ]
       },
       {
          "value":"8217 гр.Ахелой",
          "data":[
             "8217 Ахелой"
          ]
       },
       {
          "value":"9600 гр.Балчик",
          "data":[
             "9600 Балчик",
             "9605 Балчик Левски"
          ]
       },
       {
          "value":"1320 гр.Банкя",
          "data":[
             "1322 Банкя"
          ]
       },
       {
          "value":"2770 гр.Банско",
          "data":[
             "2770 Банско",
             "2771 Банско Горски Техникум"
          ]
       },
       {
          "value":"5930 гр.Белене",
          "data":[
             "5931 Белене"
          ]
       },
       {
          "value":"4470 гр.Белово",
          "data":[
             "4470 Белово"
          ]
       },
       {
          "value":"3900 гр.Белоградчик",
          "data":[
             "3900 Белоградчик"
          ]
       },
       {
          "value":"4130 с.Белозем",
          "data":[
             "4130 Белозем"
          ]
       },
       {
          "value":"9178 гр.Белослав",
          "data":[
             "9179 Белослав"
          ]
       },
       {
          "value":"3500 гр.Берковица",
          "data":[
             "3500 Берковица"
          ]
       },
       {
          "value":"1444 с.Бистрица",
          "data":[
             "1444 Бистрица"
          ]
       },
       {
          "value":"2700 гр.Благоевград",
          "data":[
             "2707 Благоевград Главна улица",
             "2700 Благоевград Еконт Експрес",
             "2706 Благоевград Еленово",
             "2704 Благоевград Запад",
             "2705 Благоевград Кончето",
             "2702 Благоевград Пазара",
             "2709 Благоевград Стадиона",
             "2708 Благоевград Струмско"
          ]
       },
       {
          "value":"2227 гр.Божурище",
          "data":[
             "2228 Божурище"
          ]
       },
       {
          "value":"2140 гр.Ботевград",
          "data":[
             "2145 Ботевград",
             "2144 Ботевград Изток"
          ]
       },
       {
          "value":"8000 гр.Бургас",
          "data":[
             "8021 Бургас",
             "8015 Бургас 24/7 Еконтомат- Автогара Запад",
             "8029 Бургас 24/7 Еконтомат- МОЛ Бургас Плаза",
             "8009 Бургас Братя Миладинови",
             "8031 Бургас Ветрен",
             "8018 Бургас Въстаническа",
             "8006 Бургас Дебелянов",
             "8026 Бургас Долно Езерово",
             "8013 Бургас Зорница",
             "8012 Бургас Изгрев",
             "8025 Бургас Изгрев Транспортна",
             "8004 Бургас Лазур",
             "8007 Бургас Меден рудник",
             "8003 Бургас Патриарх Евтимий",
             "8011 Бургас ПЗ Север",
             "8020 Бургас Роял",
             "8032 Бургас Сарафово",
             "8002 Бургас Славейков",
             "8014 Бургас Фердинандова"
          ]
       },
       {
          "value":"3200 гр.Бяла Слатина",
          "data":[
             "3201 Бяла Слатина"
          ]
       },
       {
          "value":"7100 гр.Бяла, Русенско",
          "data":[
             "7100 Бяла, Русенско"
          ]
       },
       {
          "value":"9000 гр.Варна",
          "data":[
             "9035 Варна",
             "9037 Варна - Западна промишлена зона",
             "9036 Варна 24/7 Еконтомат - МОЛ Варна",
             "9043 Варна 24/7 Еконтомат ОМВ ул. Мир",
             "9034 Варна 27-ми юли",
             "9032 Варна Аспарухово",
             "9004 Варна Бенковски",
             "9013 Варна Битоля",
             "9041 Варна Бриз",
             "9021 Варна Виница",
             "9018 Варна Владиславово",
             "9020 Варна Възраждане",
             "9028 Варна Възраждане Майка Тереза",
             "9006 Варна ЖП Гара",
             "9027 Варна Кайсиева градина",
             "9015 Варна Колхозен пазар",
             "9005 Варна Левски",
             "9011 Варна Младост Гюрлата",
             "9033 Варна Пазар Младост",
             "9003 Варна Патриарха",
             "9031 Варна Победа",
             "9017 Варна Спартак",
             "9007 Варна стадион Черно море",
             "9009 Варна Технически университет",
             "9019 Варна Трошево",
             "9029 Варна Христо Ботев",
             "9026 Варна Цветен квартал",
             "9012 Варна Чайка",
             "9042 Варна Чайка Експресна Станция",
             "9008 Варна Чаталджа",
             "9001 Варна Червен площад"
          ]
       },
       {
          "value":"9850 гр.Велики Преслав",
          "data":[
             "9853 Велики Преслав"
          ]
       },
       {
          "value":"5000 гр.Велико Търново",
          "data":[
             "5010 Велико Търново",
             "5020 Велико Търново 24/7 Еконтомат МОЛ",
             "5007 Велико Търново Бузлуджа",
             "5008 Велико Търново България",
             "5013 Велико Търново Зоната",
             "5009 Велико Търново Картала",
             "5004 Велико Търново Мизия",
             "5006 Велико Търново пл. Славейков",
             "5011 Велико Търново Христо Ботев"
          ]
       },
       {
          "value":"4600 гр.Велинград",
          "data":[
             "4600 Велинград",
             "4603 Велинград Рубин",
             "4604 Велинград Съединение"
          ]
       },
       {
          "value":"7080 гр.Ветово",
          "data":[
             "7081 Ветово"
          ]
       },
       {
          "value":"3700 гр.Видин",
          "data":[
             "3700 Видин Авангард Калето",
             "3701 Видин Крум Бъчваров",
             "3703 Видин площад Ташкюприя",
             "3704 Видин Ровно"
          ]
       },
       {
          "value":"3000 гр.Враца",
          "data":[
             "3008 Враца",
             "3009 Враца 24/7 Еконтомат - ТЦ Суми",
             "3001 Враца Автогара",
             "3004 Враца Дъбника",
             "3012 Враца Левски",
             "3011 Враца Механото",
             "3010 Враца площад Руски"
          ]
       },
       {
          "value":"3650 гр.Вълчедръм",
          "data":[
             "3651 Вълчедръм"
          ]
       },
       {
          "value":"3540 гр.Вършец",
          "data":[
             "3543 Вършец"
          ]
       },
       {
          "value":"5300 гр.Габрово",
          "data":[
             "5306 Габрово",
             "5304 Габрово ЕСА",
             "5307 Габрово Колелото",
             "5301 Габрово Мадара",
             "5303 Габрово Театъра",
             "5305 Габрово Шиваров мост"
          ]
       },
       {
          "value":"9500 гр.Генерал Тошево",
          "data":[
             "9504 Генерал Тошево"
          ]
       },
       {
          "value":"1186 с.Герман",
          "data":[
             "1186 Герман"
          ]
       },
       {
          "value":"7630 гр.Главиница",
          "data":[
             "7631 Главиница"
          ]
       },
       {
          "value":"3327 с.Гложене",
          "data":[
             "3327 Гложене"
          ]
       },
       {
          "value":"5100 гр.Горна Оряховица",
          "data":[
             "5106 Горна Оряховица",
             "5105 Горна Оряховица Гарата",
             "5104 Горна Оряховица Пролет",
             "5102 Горна Оряховица Шейново"
          ]
       },
       {
          "value":"2900 гр.Гоце Делчев",
          "data":[
             "2900 Гоце Делчев",
             "2902 Гоце Делчев Дунав",
             "2903 Гоце Делчев Неврокоп"
          ]
       },
       {
          "value":"4290 с.Градина",
          "data":[
             "4290 Градина"
          ]
       },
       {
          "value":"6280 гр.Гълъбово",
          "data":[
             "6280 Гълъбово"
          ]
       },
       {
          "value":"7150 гр.Две Могили",
          "data":[
             "7151 Две Могили"
          ]
       },
       {
          "value":"4800 гр.Девин",
          "data":[
             "4805 Девин Васил Левски"
          ]
       },
       {
          "value":"9160 гр.Девня",
          "data":[
             "9163 Девня"
          ]
       },
       {
          "value":"6850 гр.Джебел",
          "data":[
             "6852 Джебел"
          ]
       },
       {
          "value":"6400 гр.Димитровград",
          "data":[
             "6404 Димитровград Автогара Пазара",
             "6403 Димитровград Естило",
             "6402 Димитровград Тенискортове",
             "6401 Димитровград Форум"
          ]
       },
       {
          "value":"2777 гр.Добринище",
          "data":[
             "2777 Добринище"
          ]
       },
       {
          "value":"9300 гр.Добрич",
          "data":[
             "9311 Добрич",
             "9313 Добрич 24/7 Еконтомат - спирка Стоматология",
             "9305 Добрич Балик",
             "9307 Добрич Георги Кирков",
             "9303 Добрич Добричка епопея",
             "9314 Добрич Добротица",
             "9308 Добрич Летен Театър",
             "9312 Добрич Пазара",
             "9309 Добрич Родина",
             "9315 Добрич Русия"
          ]
       },
       {
          "value":"5855 гр.Долна Митрополия",
          "data":[
             "5857 Долна Митрополия"
          ]
       },
       {
          "value":"5130 гр.Долна Оряховица",
          "data":[
             "5131 Долна Оряховица"
          ]
       },
       {
          "value":"5870 гр.Долни Дъбник",
          "data":[
             "5870 Долни Дъбник"
          ]
       },
       {
          "value":"4831 гр.Доспат",
          "data":[
             "4831 Доспат"
          ]
       },
       {
          "value":"5370 гр.Дряново",
          "data":[
             "5370 Дряново"
          ]
       },
       {
          "value":"7650 гр.Дулово",
          "data":[
             "7650 Дулово"
          ]
       },
       {
          "value":"2600 гр.Дупница",
          "data":[
             "2602 Дупница",
             "2604 Дупница Патриарха",
             "2603 Дупница Тихия кът"
          ]
       },
       {
          "value":"5070 гр.Елена",
          "data":[
             "5072 Елена"
          ]
       },
       {
          "value":"2100 гр.Елин Пелин",
          "data":[
             "2100 Елин Пелин",
             "2101 Елин Пелин Площада"
          ]
       },
       {
          "value":"8700 гр.Елхово",
          "data":[
             "8700 Елхово"
          ]
       },
       {
          "value":"2180 гр.Етрополе",
          "data":[
             "2180 Етрополе"
          ]
       },
       {
          "value":"2080 гр.Златица",
          "data":[
             "2081 Златица"
          ]
       },
       {
          "value":"4980 гр.Златоград",
          "data":[
             "4980 Златоград"
          ]
       },
       {
          "value":"6570 гр.Ивайловград",
          "data":[
             "6571 Ивайловград"
          ]
       },
       {
          "value":"7400 гр.Исперих",
          "data":[
             "7400 Исперих"
          ]
       },
       {
          "value":"2050 гр.Ихтиман",
          "data":[
             "2051 Ихтиман"
          ]
       },
       {
          "value":"9650 гр.Каварна",
          "data":[
             "9650 Каварна"
          ]
       },
       {
          "value":"6100 гр.Казанлък",
          "data":[
             "6100 Казанлък Ден",
             "6105 Казанлък Изток",
             "6103 Казанлък Манастира",
             "6101 Казанлък Склад Батенберг",
             "6104 Казанлък Терес"
          ]
       },
       {
          "value":"1532 с.Казичене",
          "data":[
             "1532 Казичене"
          ]
       },
       {
          "value":"7539 с.Калипетрово",
          "data":[
             "7539 Калипетрово"
          ]
       },
       {
          "value":"4370 гр.Калофер",
          "data":[
             "4370 Калофер"
          ]
       },
       {
          "value":"4173 с.Калояново",
          "data":[
             "4173 Калояново"
          ]
       },
       {
          "value":"8120 гр.Камено",
          "data":[
             "8121 Камено"
          ]
       },
       {
          "value":"4300 гр.Карлово",
          "data":[
             "4302 Карлово",
             "4303 Карлово Пазара",
             "4301 Карлово Хан Крум"
          ]
       },
       {
          "value":"8400 гр.Карнобат",
          "data":[
             "8402 Карнобат"
          ]
       },
       {
          "value":"9930 гр.Каспичан",
          "data":[
             "9931 Каспичан"
          ]
       },
       {
          "value":"6884 гр.Кирково",
          "data":[
             "6884 Кирково"
          ]
       },
       {
          "value":"5835 гр.Кнежа",
          "data":[
             "5836 Кнежа Общината"
          ]
       },
       {
          "value":"3320 гр.Козлодуй",
          "data":[
             "3320 Козлодуй",
             "3322 Козлодуй Георги Димитров"
          ]
       },
       {
          "value":"2030 гр.Костенец",
          "data":[
             "2031 Костенец"
          ]
       },
       {
          "value":"2230 гр.Костинброд",
          "data":[
             "2231 Костинброд"
          ]
       },
       {
          "value":"8970 гр.Котел",
          "data":[
             "8970 Котел"
          ]
       },
       {
          "value":"4220 гр.Кричим",
          "data":[
             "4222 Кричим"
          ]
       },
       {
          "value":"6900 гр.Крумовград",
          "data":[
             "6900 Крумовград"
          ]
       },
       {
          "value":"7300 гр.Кубрат",
          "data":[
             "7302 Кубрат"
          ]
       },
       {
          "value":"4101 гр.Куклен",
          "data":[
             "4104 Куклен"
          ]
       },
       {
          "value":"6600 гр.Кърджали",
          "data":[
             "6605 Кърджали",
             "6606 Кърджали България",
             "6601 Кърджали Васил Априлов",
             "6603 Кърджали Веселчане",
             "6602 Кърджали Възрожденци"
          ]
       },
       {
          "value":"2500 гр.Кюстендил",
          "data":[
             "2503 Кюстендил Авангард",
             "2502 Кюстендил Батенберг",
             "2504 Кюстендил Запад",
             "2501 Кюстендил Мориц Леви"
          ]
       },
       {
          "value":"5900 гр.Левски",
          "data":[
             "5901 Левски"
          ]
       },
       {
          "value":"5500 гр.Ловеч",
          "data":[
             "5506 Ловеч",
             "5503 Ловеч Автогара",
             "5509 Ловеч Вароша",
             "5505 Ловеч Пазара"
          ]
       },
       {
          "value":"1151 с.Лозен",
          "data":[
             "1188 Лозен"
          ]
       },
       {
          "value":"3600 гр.Лом",
          "data":[
             "3602 Лом Площада",
             "3600 Лом Хан Аспарух"
          ]
       },
       {
          "value":"5770 гр.Луковит",
          "data":[
             "5770 Луковит"
          ]
       },
       {
          "value":"6550 гр.Любимец",
          "data":[
             "6551 Любимец"
          ]
       },
       {
          "value":"5140 гр.Лясковец",
          "data":[
             "5143 Лясковец Трети март"
          ]
       },
       {
          "value":"4900 гр.Мадан",
          "data":[
             "4901 Мадан"
          ]
       },
       {
          "value":"7058 гр.Мартен",
          "data":[
             "7059 Мартен"
          ]
       },
       {
          "value":"3100 гр.Мездра",
          "data":[
             "3100 Мездра"
          ]
       },
       {
          "value":"3330 гр.Мизия",
          "data":[
             "3330 Мизия"
          ]
       },
       {
          "value":"2932 с.Абланица",
          "data":[
             "2900@2932 Мобилен офис - Абланица"
          ]
       },
       {
          "value":"2660 гр.Бобошево",
          "data":[
             "2700@2660 Мобилен офис - Бобошево"
          ]
       },
       {
          "value":"3790 гр.Брегово",
          "data":[
             "3704@3790 Мобилен офис - Брегово"
          ]
       },
       {
          "value":"2360 гр.Брезник",
          "data":[
             "2301@2360 Мобилен офис - Брезник"
          ]
       },
       {
          "value":"2930 с.Вълкосел",
          "data":[
             "2900@2930 Мобилен офис - Вълкосел"
          ]
       },
       {
          "value":"9280 гр.Вълчи Дол",
          "data":[
             "9172@9280 Мобилен офис - Вълчи Дол"
          ]
       },
       {
          "value":"9870 гр.Върбица",
          "data":[
             "9853@9870 Мобилен офис - Върбица"
          ]
       },
       {
          "value":"7040 гр.Глоджево",
          "data":[
             "7302@7040 Мобилен офис - Глоджево"
          ]
       },
       {
          "value":"8990 с.Градец",
          "data":[
             "8800@8990 Мобилен офис - Градец"
          ]
       },
       {
          "value":"9120 гр.Долни Чифлик",
          "data":[
             "9179@9120 Мобилен офис - Долни Чифлик"
          ]
       },
       {
          "value":"4641 с.Дорково",
          "data":[
             "4640@4641 Мобилен офис - Дорково"
          ]
       },
       {
          "value":"2210 гр.Драгоман",
          "data":[
             "2201@2210 Мобилен офис - Драгоман"
          ]
       },
       {
          "value":"9168 с.Езерово",
          "data":[
             "9179@9168 Мобилен офис - Езерово"
          ]
       },
       {
          "value":"8988 с.Жеравна",
          "data":[
             "8800@8988 Мобилен офис - Жеравна"
          ]
       },
       {
          "value":"8210 гр.Каблешково",
          "data":[
             "823028@8210 Мобилен офис - Каблешково"
          ]
       },
       {
          "value":"4644 гр.Костандово",
          "data":[
             "4640@4644 Мобилен офис - Костандово"
          ]
       },
       {
          "value":"2640 гр.Кочериново",
          "data":[
             "2700@2640 Мобилен офис - Кочериново"
          ]
       },
       {
          "value":"7290 гр.Лозница",
          "data":[
             "7203@7290 Мобилен офис - Лозница"
          ]
       },
       {
          "value":"2630 гр.Рила",
          "data":[
             "2700@2630 Мобилен офис - Рила"
          ]
       },
       {
          "value":"2650 гр.Сапарева Баня",
          "data":[
             "2602@2650 Мобилен офис - Сапарева Баня"
          ]
       },
       {
          "value":"2950 с.Сатовча",
          "data":[
             "2900@2950 Мобилен офис - Сатовча"
          ]
       },
       {
          "value":"5580 гр.Угърчин",
          "data":[
             "5506@5580 Мобилен офис - Угърчин"
          ]
       },
       {
          "value":"7051 с.Червена Вода",
          "data":[
             "7029@7051 Мобилен офис - Червена Вода"
          ]
       },
       {
          "value":"8989 с.Ябланово",
          "data":[
             "8800@8989 Мобилен офис - Ябланово"
          ]
       },
       {
          "value":"2790 гр.Якоруда",
          "data":[
             "27628@2790 Мобилен офис - Якоруда"
          ]
       },
       {
          "value":"6800 гр.Момчилград",
          "data":[
             "6800 Момчилград"
          ]
       },
       {
          "value":"3400 гр.Монтана",
          "data":[
             "3401 Монтана",
             "3403 Монтана Индустриална",
             "3405 Монтана Младост 2",
             "3404 Монтана Пъстрина",
             "3402 Монтана Театъра"
          ]
       },
       {
          "value":"8230 гр.Несебър",
          "data":[
             "82301 Несебър",
             "8231 Несебър Склад"
          ]
       },
       {
          "value":"8900 гр.Нова Загора",
          "data":[
             "8902 Нова Загора Базара",
             "8900 Нова Загора В.Левски"
          ]
       },
       {
          "value":"1280 гр.Нови Искър",
          "data":[
             "1280 Нови Искър",
             "1282 Нови Искър Кумарица"
          ]
       },
       {
          "value":"9900 гр.Нови Пазар",
          "data":[
             "9902 Нови Пазар"
          ]
       },
       {
          "value":"8250 гр.Обзор",
          "data":[
             "8252 Обзор"
          ]
       },
       {
          "value":"7900 гр.Омуртаг",
          "data":[
             "7901 Омуртаг"
          ]
       },
       {
          "value":"3300 гр.Оряхово",
          "data":[
             "3300 Оряхово"
          ]
       },
       {
          "value":"6155 гр.Павел Баня",
          "data":[
             "6155 Павел баня"
          ]
       },
       {
          "value":"5200 гр.Павликени",
          "data":[
             "5203 Павликени",
             "5226 Павликени 24/7 Еконтомат. бул. Руски № 59",
             "5202 Павликени Цар Иван Асен"
          ]
       },
       {
          "value":"4400 гр.Пазарджик",
          "data":[
             "4402 Пазарджик",
             "4409 Пазарджик Булаир",
             "4406 Пазарджик Запад",
             "4407 Пазарджик Канала",
             "4401 Пазарджик Механото",
             "4408 Пазарджик Пазара"
          ]
       },
       {
          "value":"4500 гр.Панагюрище",
          "data":[
             "4500 Панагюрище",
             "4502 Панагюрище Сити Център"
          ]
       },
       {
          "value":"2300 гр.Перник",
          "data":[
             "2308 Перник 24/7 Еконтомат - Начална спирка",
             "2306 Перник Даскалово",
             "2314 Перник Изток",
             "2312 Перник Мошино",
             "2301 Перник Пазара",
             "2313 Перник Пашов"
          ]
       },
       {
          "value":"4225 гр.Перущица",
          "data":[
             "4226 Перущица"
          ]
       },
       {
          "value":"2850 гр.Петрич",
          "data":[
             "2853 Петрич Ален мак",
             "2850 Петрич Монопола",
             "2852 Петрич Промишлена зона"
          ]
       },
       {
          "value":"4550 гр.Пещера",
          "data":[
             "4552 Пещера България",
             "4551 Пещера Изгрев"
          ]
       },
       {
          "value":"2070 гр.Пирдоп",
          "data":[
             "2071 Пирдоп"
          ]
       },
       {
          "value":"5800 гр.Плевен",
          "data":[
             "5803 Плевен",
             "5816 Плевен 24/7 Еконтомат - Гарата",
             "5806 Плевен Васил Левски",
             "5811 Плевен Възраждане",
             "5810 Плевен Дружба",
             "5814 Плевен Метро",
             "5807 Плевен Неофит Рилски",
             "5812 Плевен Сан Стефано",
             "5815 Плевен Стара Гара",
             "5813 Плевен Сторгозия",
             "5802 Плевен Хаджи Димитър",
             "5808 Плевен Христо Ботев"
          ]
       },
       {
          "value":"4000 гр.Пловдив",
          "data":[
             "4044 Пловдив",
             "4052 Пловдив 24/7 Еконтомат - Тракия",
             "4055 Пловдив 24/7 Еконтомат МОЛ Марково тепе",
             "4060 Пловдив 24/7 Еконтомат ОМВ бул. България",
             "4061 Пловдив Автогара Родопи",
             "4058 Пловдив Адата",
             "4015 Пловдив Арчарица",
             "4002 Пловдив Беласица",
             "4054 Пловдив Беломорски",
             "4040 Пловдив Брезовско шосе",
             "4032 Пловдив Васил Левски",
             "4009 Пловдив ВИП",
             "4005 Пловдив Гербера кв.Тракия",
             "4046 Пловдив Дунав",
             "4045 Пловдив ЖП Гара",
             "4026 Пловдив Изгрев",
             "4010 Пловдив Капана",
             "4006 Пловдив Коматево",
             "4003 Пловдив Кършиака",
             "4056 Пловдив Кючук Париж",
             "4031 Пловдив Мараша",
             "4035 Пловдив Мараша Младежка",
             "4014 Пловдив Марица",
             "4062 Пловдив Марица Гардънс",
             "4043 Пловдив Митницата",
             "4047 Пловдив Орфей",
             "4059 Пловдив Освобождение 5",
             "4029 Пловдив Панаира",
             "4037 Пловдив Прослав",
             "4034 Пловдив Руски",
             "4019 Пловдив Свобода",
             "4024 Пловдив Север",
             "4038 Пловдив Скобелева майка",
             "4016 Пловдив Смирненски",
             "4057 Пловдив Сточна гара",
             "4042 Пловдив Събота Пазар",
             "4041 Пловдив Съдийски",
             "4004 Пловдив Тепето",
             "4007 Пловдив Тракия",
             "4023 Пловдив Тракия Матевски",
             "4036 Пловдив Търговска зона",
             "4018 Пловдив Христо Ботев",
             "4033 Пловдив Южен"
          ]
       },
       {
          "value":"5180 гр.Полски Тръмбеш",
          "data":[
             "5181 Полски Тръмбеш"
          ]
       },
       {
          "value":"8200 гр.Поморие",
          "data":[
             "8203 Поморие",
             "8205 Поморие Нов град"
          ]
       },
       {
          "value":"7800 гр.Попово",
          "data":[
             "7800 Попово",
             "7801 Попово Фотинова"
          ]
       },
       {
          "value":"2161 гр.Правец",
          "data":[
             "2165 Правец"
          ]
       },
       {
          "value":"8290 гр.Приморско",
          "data":[
             "8291 Приморско"
          ]
       },
       {
          "value":"9200 гр.Провадия",
          "data":[
             "9202 Провадия"
          ]
       },
       {
          "value":"4270 гр.Първомай",
          "data":[
             "4270 Първомай",
             "4271 Първомай Дебър"
          ]
       },
       {
          "value":"8238 с.Равда",
          "data":[
             "8221 Равда"
          ]
       },
       {
          "value":"6260 гр.Раднево",
          "data":[
             "6261 Раднево"
          ]
       },
       {
          "value":"2400 гр.Радомир",
          "data":[
             "2400 Радомир"
          ]
       },
       {
          "value":"7200 гр.Разград",
          "data":[
             "7203 Разград Автогара",
             "7201 Разград Бели Лом",
             "7204 Разград Орел"
          ]
       },
       {
          "value":"2760 гр.Разлог",
          "data":[
             "2762 Разлог",
             "2761 Разлог Предела"
          ]
       },
       {
          "value":"4640 гр.Ракитово",
          "data":[
             "4640 Ракитово"
          ]
       },
       {
          "value":"4150 гр.Раковски",
          "data":[
             "4152 Раковски",
             "4153 Раковски Секирово"
          ]
       },
       {
          "value":"4960 гр.Рудозем",
          "data":[
             "4960 Рудозем"
          ]
       },
       {
          "value":"8540 с.Руен",
          "data":[
             "8540 Руен"
          ]
       },
       {
          "value":"7000 гр.Русе",
          "data":[
             "7029 Русе",
             "7032 Русе 24/7 Еконтомат - Покрит пазар",
             "7006 Русе Борисова",
             "7046 Русе България 123",
             "7042 Русе Волов",
             "7019 Русе Възраждане",
             "7028 Русе Градски площад",
             "7027 Русе Добруджа",
             "7041 Русе Западна зона",
             "7008 Русе Здравец",
             "7022 Русе Кръговото",
             "7045 Русе КТМ",
             "7005 Русе Локомотив",
             "7044 Русе Медика",
             "7033 Русе Мототехника",
             "7013 Русе Николаевска",
             "7023 Русе Родина",
             "7026 Русе Солун",
             "7039 Русе Търговска",
             "7020 Русе Халите",
             "7043 Русе Чародейка"
          ]
       },
       {
          "value":"2000 гр.Самоков",
          "data":[
             "2000 Самоков",
             "2002 Самоков кв.Самоково",
             "2001 Самоков Площада"
          ]
       },
       {
          "value":"2800 гр.Сандански",
          "data":[
             "2800 Сандански",
             "2802 Сандански Базилика",
             "2801 Сандански Стамболов"
          ]
       },
       {
          "value":"8256 гр.Свети Влас",
          "data":[
             "8257 Свети Влас"
          ]
       },
       {
          "value":"6500 гр.Свиленград",
          "data":[
             "6500 Свиленград",
             "6501 Свиленград Младост"
          ]
       },
       {
          "value":"5250 гр.Свищов",
          "data":[
             "5250 Свищов",
             "5252 Свищов Велешана",
             "5251 Свищов Студентски град"
          ]
       },
       {
          "value":"2260 гр.Своге",
          "data":[
             "2261 Своге"
          ]
       },
       {
          "value":"5400 гр.Севлиево",
          "data":[
             "5402 Севлиево",
             "5403 Севлиево 24/7 Еконтомат - Общината",
             "5405 Севлиево пл. Свобода"
          ]
       },
       {
          "value":"4490 гр.Септември",
          "data":[
             "4491 Септември"
          ]
       },
       {
          "value":"7500 гр.Силистра",
          "data":[
             "7502 Силистра Аврора ОМВ",
             "7505 Силистра Дап",
             "7504 Силистра Македония"
          ]
       },
       {
          "value":"6490 гр.Симеоновград",
          "data":[
             "6492 Симеоновград"
          ]
       },
       {
          "value":"2730 гр.Симитли",
          "data":[
             "2730 Симитли"
          ]
       },
       {
          "value":"8800 гр.Сливен",
          "data":[
             "8805 Сливен 24/7 Еконтомат - МБАЛ",
             "8801 Сливен Аксаков",
             "8811 Сливен Бр. Миладинови",
             "8807 Сливен Българка",
             "8806 Сливен Васил Левски",
             "8804 Сливен Дружба",
             "8803 Сливен Клуцохор",
             "8808 Сливен Панайот Хитов",
             "8809 Сливен Промишлена зона",
             "8800 Сливен Светлина"
          ]
       },
       {
          "value":"2200 гр.Сливница",
          "data":[
             "2201 Сливница"
          ]
       },
       {
          "value":"7060 гр.Сливо Поле",
          "data":[
             "7061 Сливо поле"
          ]
       },
       {
          "value":"8240 гр.Слънчев Бряг",
          "data":[
             "8244 Слънчев бряг 24/7 Еконтомат",
             "8242 Слънчев бряг Автогара",
             "8241 Слънчев бряг Вива"
          ]
       },
       {
          "value":"4700 гр.Смолян",
          "data":[
             "4704 Смолян",
             "4705 Смолян Военно окръжие",
             "4708 Смолян Райково",
             "4706 Смолян Устово"
          ]
       },
       {
          "value":"8130 гр.Созопол",
          "data":[
             "8130 Созопол Републиканска"
          ]
       },
       {
          "value":"4330 гр.Сопот",
          "data":[
             "4330 Сопот"
          ]
       },
       {
          "value":"1000 гр.София",
          "data":[
             "1127 София",
             "1712 София 24/7 Еконтомат - ОМВ 8-ми декември",
             "1701 София 24/7 Еконтомат - ОМВ Ботевградско шосе",
             "1705 София 24/7 Еконтомат - ОМВ България",
             "1711 София 24/7 Еконтомат - ОМВ Владимир Вазов",
             "1706 София 24/7 Еконтомат - ОМВ Г.М. Димитров",
             "1716 София 24/7 Еконтомат - ОМВ Дружба",
             "1708 София 24/7 Еконтомат - ОМВ Ломско шосе",
             "1704 София 24/7 Еконтомат - ОМВ Люлин 10",
             "1715 София 24/7 Еконтомат - ОМВ Опълченска",
             "1725 София 24/7 Еконтомат - ОМВ Пробива",
             "1710 София 24/7 Еконтомат - ОМВ Резбарска",
             "1707 София 24/7 Еконтомат - ОМВ Рожен",
             "1713 София 24/7 Еконтомат - ОМВ София Младост 1 А",
             "1709 София 24/7 Еконтомат - ОМВ Столетов",
             "1703 София 24/7 Еконтомат - ОМВ Цариградско шосе",
             "1714 София 24/7 Еконтомат бул. Стамболийски 87",
             "1107 София Аксаков",
             "1102 София Арсеналски",
             "1077 София Бели брези",
             "1103 София Бели Дунав",
             "1155 София Бенковски",
             "1034 София Бигла",
             "1003 София Бизнес Парк",
             "1083 София Борис Стефанов",
             "1717 София Борис Стефанов Експресна Станция",
             "1119 София Борово",
             "1129 София Борса Къра",
             "1158 София Бояна",
             "1120 София БЦ Витоша",
             "1178 София Вас метал",
             "1062 София Военна Рампа",
             "1032 София Гара искър",
             "1012 София Гладстон",
             "1163 София Горна баня",
             "1064 София Горубляне",
             "1182 София Гурко",
             "1149 София Гюешево БЦ Сердика",
             "1088 София Делийска воденица",
             "1052 София Дианабад",
             "1106 София Драгалевци",
             "1055 София Дружба 1",
             "1116 София Дружба 2",
             "1157 София Дървеница",
             "1170 София Емил Марков",
             "1113 София Западен парк",
             "1144 София Захари Стоянов",
             "1148 София Иван Вазов",
             "1011 София Изток",
             "1013 София Илиянци - База 1",
             "1153 София Илиянци - Втора база",
             "1080 София кв.Витоша",
             "1004 София Кемпински",
             "1190 София Климент Охридски",
             "1164 София Княжево",
             "1049 София Козлодуй",
             "1076 София Константин Величков",
             "1118 София Красна поляна",
             "1005 София Красно село",
             "1183 София Кръстова вада",
             "1177 София Лагера",
             "1038 София Левски",
             "1123 София Линкълн",
             "1112 София Ломско шосе",
             "1132 София Лъвов мост",
             "1086 София Любляна",
             "1187 София Люлин",
             "1139 София Люлин 1 Европа",
             "1140 София Люлин 5",
             "1037 София Малашевци",
             "1085 София Манастирски ливади",
             "1137 София Манастирски ливади Бокар",
             "1179 София Младост",
             "1056 София Младост 1",
             "1184 София Младост 1А Пътеките",
             "1069 София Младост 2",
             "1175 София Младост 4",
             "1172 София Младост Окръжна болница",
             "1110 София Модерно предградие",
             "1078 София Момина клисура",
             "1027 София Моста Чавдар",
             "1146 София Мусагеница",
             "1108 София Нюман",
             "1058 София Обеля 1",
             "1082 София Обеля 2",
             "1051 София Овча купел",
             "1189 София Овча купел 1 - бул. Овча купел",
             "1174 София Овча купел 2",
             "1024 София Одрин",
             "1075 София Опълченска",
             "1138 София Орион",
             "1150 София Орландовци",
             "1068 София Орлов мост",
             "1180 София Павлово",
             "1081 София Паметника Левски",
             "1181 София Панчарево",
             "1192 София парк – ул. Рачо Казанджията",
             "1090 София Плиска",
             "1130 София Разсадника",
             "1121 София Раковски",
             "1115 София Редута",
             "1173 София Римска стена",
             "1061 София Руски паметник",
             "1035 София Света Троица",
             "1073 София Свобода",
             "1065 София Силвър Център Люлин",
             "1154 София Симеоново",
             "1161 София Слатина",
             "1016 София Стамболийски - бул. Ал. Стамболийски 87",
             "1152 София Стамболийски - ул. Осогово 36",
             "1171 София Стрелбище",
             "1009 София Студентски град",
             "1168 София Сухата река",
             "1176 София Суходол",
             "1043 София Технически Университет",
             "1131 София Толстой",
             "1191 София Требич Латин Колев",
             "1007 София Универсиада",
             "1025 София Фондови жилища",
             "1097 София Хаджи Димитър",
             "1089 София Хиподрума",
             "1136 София Христо Смирненски",
             "1060 София Цар Самуил",
             "1001 София Цар Симеон",
             "1125 София Цариградски комплекс",
             "1022 София Цариградско шосе",
             "1162 София Челопечене",
             "1185 София Черковна"
          ]
       },
       {
          "value":"8300 гр.Средец",
          "data":[
             "8301 Средец"
          ]
       },
       {
          "value":"4210 гр.Стамболийски",
          "data":[
             "4211 Стамболийски"
          ]
       },
       {
          "value":"6000 гр.Стара Загора",
          "data":[
             "6020 Стара Загора 24/7 Еконтомат - Парк МОЛ",
             "6018 Стара Загора 24/7 Еконтомат - Център",
             "6017 Стара Загора Гурко",
             "6013 Стара Загора ЖП гара",
             "6007 Стара Загора Индустриален",
             "6010 Стара Загора кв.Железник",
             "6014 Стара Загора Мартинели",
             "6016 Стара Загора Мототехника",
             "6012 Стара Загора Площад Берое",
             "6011 Стара Загора Раковски",
             "6019 Стара Загора Три Чучурa",
             "6021 Стара Загора Хаджи Д. Асенов",
             "6003 Стара Загора Цар Иван Шишман"
          ]
       },
       {
          "value":"5150 гр.Стражица",
          "data":[
             "5152 Стражица"
          ]
       },
       {
          "value":"9170 гр.Суворово",
          "data":[
             "9172 Суворово"
          ]
       },
       {
          "value":"4190 гр.Съединение",
          "data":[
             "4190 Съединение"
          ]
       },
       {
          "value":"4633 гр.Сърница",
          "data":[
             "4634 Сърница"
          ]
       },
       {
          "value":"8890 гр.Твърдица",
          "data":[
             "8890 Твърдица"
          ]
       },
       {
          "value":"9450 гр.Тервел",
          "data":[
             "9451 Тервел"
          ]
       },
       {
          "value":"5700 гр.Тетевен",
          "data":[
             "5701 Тетевен ВИП"
          ]
       },
       {
          "value":"6560 гр.Тополовград",
          "data":[
             "6561 Тополовград"
          ]
       },
       {
          "value":"5600 гр.Троян",
          "data":[
             "5600 Троян",
             "5601 Троян Каравелов",
             "5602 Троян Лъгът"
          ]
       },
       {
          "value":"4199 с.Труд",
          "data":[
             "4199 Труд"
          ]
       },
       {
          "value":"5350 гр.Трявна",
          "data":[
             "5352 Трявна"
          ]
       },
       {
          "value":"7600 гр.Тутракан",
          "data":[
             "7600 Тутракан"
          ]
       },
       {
          "value":"7700 гр.Търговище",
          "data":[
             "7705 Търговище",
             "7704 Търговище Запад",
             "7706 Търговище Пазара",
             "7701 Търговище Театъра"
          ]
       },
       {
          "value":"6450 гр.Харманли",
          "data":[
             "6450 Харманли",
             "6451 Харманли Пазара"
          ]
       },
       {
          "value":"6300 гр.Хасково",
          "data":[
             "6308 Хасково",
             "6310 Хасково Болярово",
             "6306 Хасково Веспрем",
             "6302 Хасково кв.Бадема",
             "6307 Хасково кв.Хисаря",
             "6300 Хасково НЛЦ",
             "6303 Хасково Орфей",
             "6304 Хасково Цар Освободител",
             "6305 Хасково Kняз Борис",
             "6301 Хасково XXI -ви век"
          ]
       },
       {
          "value":"4180 гр.Хисаря",
          "data":[
             "4181 Хисаря"
          ]
       },
       {
          "value":"8260 гр.Царево",
          "data":[
             "8260 Царево"
          ]
       },
       {
          "value":"4850 гр.Чепеларе",
          "data":[
             "4854 Чепеларе"
          ]
       },
       {
          "value":"5980 гр.Червен Бряг",
          "data":[
             "5982 Червен бряг 24/7 Еконтомат - Център",
             "5981 Червен Бряг Общината"
          ]
       },
       {
          "value":"6200 гр.Чирпан",
          "data":[
             "6205 Чирпан Георги Димитров",
             "6202 Чирпан Площада"
          ]
       },
       {
          "value":"9680 гр.Шабла",
          "data":[
             "9681 Шабла"
          ]
       },
       {
          "value":"9700 гр.Шумен",
          "data":[
             "9709 Шумен",
             "9712 Шумен 24/7 Еконтомат - Херсон",
             "9708 Шумен Дивдядово",
             "9707 Шумен Осми март",
             "9710 Шумен Руски Паметник",
             "9711 Шумен Скобелев",
             "9705 Шумен Тракия",
             "9703 Шумен Турбо",
             "9701 Шумен Цар Освободител"
          ]
       },
       {
          "value":"7078 гр.Щръклево",
          "data":[
             "7078 Щръклево"
          ]
       },
       {
          "value":"5750 гр.Ябланица",
          "data":[
             "5750 Ябланица"
          ]
       },
       {
          "value":"4113 с.Ягодово",
          "data":[
             "4113 Ягодово"
          ]
       },
       {
          "value":"8600 гр.Ямбол",
          "data":[
             "8604 Ямбол",
             "8611 Ямбол Автогара Батак",
             "8608 Ямбол Бенковски",
             "8606 Ямбол Граф Игнатиев",
             "8609 Ямбол Златен рог",
             "8610 Ямбол Индустриална",
             "8601 Ямбол Искър",
             "8603 Ямбол Трите вятъра"
          ]
       }
    ];
  })
  .always( function() {
    jQuery('#city_office').autocomplete({
      source: suggestions,
      select: function (e, ui){
        jQuery('#office').html("");

        for (var i = 0; i < suggestions.length; i++) {
          if(suggestions[i].value == ui.item.value){
            jQuery.each(suggestions[i].data, function(i,ie){
                jQuery('#office').prepend(jQuery('<option>',{
                  value: ie,
                  text: ie,
                }));
            });
          };
        };
      }
    });
  });

  jQuery("#to_office").show();
    jQuery( ".radio_office" ).click(function() {
      jQuery( ".custom_address" ).hide();
    });

    if (document.getElementById('radio_office')) {
      document
          .getElementById('radio_office')
          .addEventListener("click",
              function () {
                  document.getElementById("to_office")
                      .style.display = "block";
                  document.getElementById("to_custom_address")
                      .style.display = "none"
              }
          );
    }

    if (document.getElementById('radio_address')) {
        document
            .getElementById('radio_address')
            .addEventListener("click",
                function () {
                    document.getElementById("to_custom_address")
                        .style.display = "block";
                    document.getElementById("to_office")
                        .style.display = "none"
                }
            );
    }
});
